GopalSaraf/Practicals/PSDL/include/proc/pic16f15386.h
extern volatile RF0PPSbits_t RF0PPSbits __at(0x1E38);
// bitfield macros
#define _RF0PPS_RF0PPS0_POSN                                0x0
#define _RF0PPS_RF0PPS0_POSITION                            0x0
#define _RF0PPS_RF0PPS0_SIZE                                0x1
#define _RF0PPS_RF0PPS0_LENGTH                              0x1
#define _RF0PPS_RF0PPS0_MASK                                0x1
#define _RF0PPS_RF0PPS1_POSN                                0x1
#define _RF0PPS_RF0PPS1_POSITION                            0x1
#define _RF0PPS_RF0PPS1_SIZE                                0x1
#define _RF0PPS_RF0PPS1_LENGTH                              0x1
#define _RF0PPS_RF0PPS1_MASK                                0x2
#define _RF0PPS_RF0PPS2_POSN                                0x2
#define _RF0PPS_RF0PPS2_POSITION                            0x2
#define _RF0PPS_RF0PPS2_SIZE                                0x1
#define _RF0PPS_RF0PPS2_LENGTH                              0x1
#define _RF0PPS_RF0PPS2_MASK                                0x4
#define _RF0PPS_RF0PPS3_POSN                                0x3
#define _RF0PPS_RF0PPS3_POSITION                            0x3
#define _RF0PPS_RF0PPS3_SIZE                                0x1
#define _RF0PPS_RF0PPS3_LENGTH                              0x1
#define _RF0PPS_RF0PPS3_MASK                                0x8
#define _RF0PPS_RF0PPS4_POSN                                0x4
#define _RF0PPS_RF0PPS4_POSITION                            0x4
#define _RF0PPS_RF0PPS4_SIZE                                0x1
#define _RF0PPS_RF0PPS4_LENGTH                              0x1
#define _RF0PPS_RF0PPS4_MASK                                0x10

// Register: RF1PPS
#define RF1PPS RF1PPS
extern volatile unsigned char           RF1PPS              __at(0x1E39);
#ifndef _LIB_BUILD
asm("RF1PPS equ 01E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF1PPS0                :1;
        unsigned RF1PPS1                :1;
        unsigned RF1PPS2                :1;
        unsigned RF1PPS3                :1;
        unsigned RF1PPS4                :1;
    };
} RF1PPSbits_t;
extern volatile RF1PPSbits_t RF1PPSbits __at(0x1E39);
// bitfield macros
#define _RF1PPS_RF1PPS0_POSN                                0x0
#define _RF1PPS_RF1PPS0_POSITION                            0x0
#define _RF1PPS_RF1PPS0_SIZE                                0x1
#define _RF1PPS_RF1PPS0_LENGTH                              0x1
#define _RF1PPS_RF1PPS0_MASK                                0x1
#define _RF1PPS_RF1PPS1_POSN                                0x1
#define _RF1PPS_RF1PPS1_POSITION                            0x1
#define _RF1PPS_RF1PPS1_SIZE                                0x1
#define _RF1PPS_RF1PPS1_LENGTH                              0x1
#define _RF1PPS_RF1PPS1_MASK                                0x2
#define _RF1PPS_RF1PPS2_POSN                                0x2
#define _RF1PPS_RF1PPS2_POSITION                            0x2
#define _RF1PPS_RF1PPS2_SIZE                                0x1
#define _RF1PPS_RF1PPS2_LENGTH                              0x1
#define _RF1PPS_RF1PPS2_MASK                                0x4
#define _RF1PPS_RF1PPS3_POSN                                0x3
#define _RF1PPS_RF1PPS3_POSITION                            0x3
#define _RF1PPS_RF1PPS3_SIZE                                0x1
#define _RF1PPS_RF1PPS3_LENGTH                              0x1
#define _RF1PPS_RF1PPS3_MASK                                0x8
#define _RF1PPS_RF1PPS4_POSN                                0x4
#define _RF1PPS_RF1PPS4_POSITION                            0x4
#define _RF1PPS_RF1PPS4_SIZE                                0x1
#define _RF1PPS_RF1PPS4_LENGTH                              0x1
#define _RF1PPS_RF1PPS4_MASK                                0x10

// Register: RF2PPS
#define RF2PPS RF2PPS
extern volatile unsigned char           RF2PPS              __at(0x1E3A);
#ifndef _LIB_BUILD
asm("RF2PPS equ 01E3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF2PPS0                :1;
        unsigned RF2PPS1                :1;
        unsigned RF2PPS2                :1;
        unsigned RF2PPS3                :1;
        unsigned RF2PPS4                :1;
    };
} RF2PPSbits_t;
extern volatile RF2PPSbits_t RF2PPSbits __at(0x1E3A);
// bitfield macros
#define _RF2PPS_RF2PPS0_POSN                                0x0
#define _RF2PPS_RF2PPS0_POSITION                            0x0
#define _RF2PPS_RF2PPS0_SIZE                                0x1
#define _RF2PPS_RF2PPS0_LENGTH                              0x1
#define _RF2PPS_RF2PPS0_MASK                                0x1
#define _RF2PPS_RF2PPS1_POSN                                0x1
#define _RF2PPS_RF2PPS1_POSITION                            0x1
#define _RF2PPS_RF2PPS1_SIZE                                0x1
#define _RF2PPS_RF2PPS1_LENGTH                              0x1
#define _RF2PPS_RF2PPS1_MASK                                0x2
#define _RF2PPS_RF2PPS2_POSN                                0x2
#define _RF2PPS_RF2PPS2_POSITION                            0x2
#define _RF2PPS_RF2PPS2_SIZE                                0x1
#define _RF2PPS_RF2PPS2_LENGTH                              0x1
#define _RF2PPS_RF2PPS2_MASK                                0x4
#define _RF2PPS_RF2PPS3_POSN                                0x3
#define _RF2PPS_RF2PPS3_POSITION                            0x3
#define _RF2PPS_RF2PPS3_SIZE                                0x1
#define _RF2PPS_RF2PPS3_LENGTH                              0x1
#define _RF2PPS_RF2PPS3_MASK                                0x8
#define _RF2PPS_RF2PPS4_POSN                                0x4
#define _RF2PPS_RF2PPS4_POSITION                            0x4
#define _RF2PPS_RF2PPS4_SIZE                                0x1
#define _RF2PPS_RF2PPS4_LENGTH                              0x1
#define _RF2PPS_RF2PPS4_MASK                                0x10

// Register: RF3PPS
#define RF3PPS RF3PPS
extern volatile unsigned char           RF3PPS              __at(0x1E3B);
#ifndef _LIB_BUILD
asm("RF3PPS equ 01E3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF3PPS0                :1;
        unsigned RF3PPS1                :1;
        unsigned RF3PPS2                :1;
        unsigned RF3PPS3                :1;
        unsigned RF3PPS4                :1;
    };
} RF3PPSbits_t;
extern volatile RF3PPSbits_t RF3PPSbits __at(0x1E3B);
// bitfield macros
#define _RF3PPS_RF3PPS0_POSN                                0x0
#define _RF3PPS_RF3PPS0_POSITION                            0x0
#define _RF3PPS_RF3PPS0_SIZE                                0x1
#define _RF3PPS_RF3PPS0_LENGTH                              0x1
#define _RF3PPS_RF3PPS0_MASK                                0x1
#define _RF3PPS_RF3PPS1_POSN                                0x1
#define _RF3PPS_RF3PPS1_POSITION                            0x1
#define _RF3PPS_RF3PPS1_SIZE                                0x1
#define _RF3PPS_RF3PPS1_LENGTH                              0x1
#define _RF3PPS_RF3PPS1_MASK                                0x2
#define _RF3PPS_RF3PPS2_POSN                                0x2
#define _RF3PPS_RF3PPS2_POSITION                            0x2
#define _RF3PPS_RF3PPS2_SIZE                                0x1
#define _RF3PPS_RF3PPS2_LENGTH                              0x1
#define _RF3PPS_RF3PPS2_MASK                                0x4
#define _RF3PPS_RF3PPS3_POSN                                0x3
#define _RF3PPS_RF3PPS3_POSITION                            0x3
#define _RF3PPS_RF3PPS3_SIZE                                0x1
#define _RF3PPS_RF3PPS3_LENGTH                              0x1
#define _RF3PPS_RF3PPS3_MASK                                0x8
#define _RF3PPS_RF3PPS4_POSN                                0x4
#define _RF3PPS_RF3PPS4_POSITION                            0x4
#define _RF3PPS_RF3PPS4_SIZE                                0x1
#define _RF3PPS_RF3PPS4_LENGTH                              0x1
#define _RF3PPS_RF3PPS4_MASK                                0x10

// Register: RF4PPS
#define RF4PPS RF4PPS
extern volatile unsigned char           RF4PPS              __at(0x1E3C);
#ifndef _LIB_BUILD
asm("RF4PPS equ 01E3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF4PSS0                :1;
        unsigned RF4PSS1                :1;
        unsigned RF4PSS2                :1;
        unsigned RF4PSS3                :1;
        unsigned RF4PSS4                :1;
    };
} RF4PPSbits_t;
extern volatile RF4PPSbits_t RF4PPSbits __at(0x1E3C);
// bitfield macros
#define _RF4PPS_RF4PSS0_POSN                                0x0
#define _RF4PPS_RF4PSS0_POSITION                            0x0
#define _RF4PPS_RF4PSS0_SIZE                                0x1
#define _RF4PPS_RF4PSS0_LENGTH                              0x1
#define _RF4PPS_RF4PSS0_MASK                                0x1
#define _RF4PPS_RF4PSS1_POSN                                0x1
#define _RF4PPS_RF4PSS1_POSITION                            0x1
#define _RF4PPS_RF4PSS1_SIZE                                0x1
#define _RF4PPS_RF4PSS1_LENGTH                              0x1
#define _RF4PPS_RF4PSS1_MASK                                0x2
#define _RF4PPS_RF4PSS2_POSN                                0x2
#define _RF4PPS_RF4PSS2_POSITION                            0x2
#define _RF4PPS_RF4PSS2_SIZE                                0x1
#define _RF4PPS_RF4PSS2_LENGTH                              0x1
#define _RF4PPS_RF4PSS2_MASK                                0x4
#define _RF4PPS_RF4PSS3_POSN                                0x3
#define _RF4PPS_RF4PSS3_POSITION                            0x3
#define _RF4PPS_RF4PSS3_SIZE                                0x1
#define _RF4PPS_RF4PSS3_LENGTH                              0x1
#define _RF4PPS_RF4PSS3_MASK                                0x8
#define _RF4PPS_RF4PSS4_POSN                                0x4
#define _RF4PPS_RF4PSS4_POSITION                            0x4
#define _RF4PPS_RF4PSS4_SIZE                                0x1
#define _RF4PPS_RF4PSS4_LENGTH                              0x1
#define _RF4PPS_RF4PSS4_MASK                                0x10

